In [6]:
# use sql to connect to imdb.db
import sqlite3
import pandas as pd

# connect to the database
conn = sqlite3.connect('imdb.db')

# get an inventory of the tables
pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", conn)

               name
0       name_basics
1      title_basics
2  title_principals
3     title_ratings
4        title_crew
5        title_akas
6     title_episode

In [7]:
# go over name_basics
pd.read_sql_query("SELECT * FROM name_basics LIMIT 5;", conn)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"actor,miscellaneous,producer","tt0072308,tt0050419,tt0053137,tt0027125"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack,archive_footage","tt0037382,tt0075213,tt0117057,tt0038355"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,music_department,producer","tt0057345,tt0049189,tt0056404,tt0054452"
3,nm0000004,John Belushi,1949,1982,"actor,writer,music_department","tt0072562,tt0077975,tt0080455,tt0078723"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0050986,tt0083922,tt0050976,tt0069467"

In [8]:
# go over title_basics
pd.read_sql_query("SELECT * FROM title_basics;", conn)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,5,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [9]:
# go over title_principals
pd.read_sql_query("SELECT * FROM title_principals LIMIT 5;", conn)

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Self""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0005690,producer,producer,\N
3,tt0000001,4,nm0374658,cinematographer,director of photography,\N
4,tt0000002,1,nm0721526,director,\N,\N

In [18]:
# go over title_ratings
pd.read_sql_query("SELECT * FROM title_ratings LIMIT 5;", conn)

      tconst  averageRating  numVotes
0  tt0000001            5.7      2082
1  tt0000002            5.6       280
2  tt0000003            6.5      2081
3  tt0000004            5.4       181
4  tt0000005            6.2      2819

In [19]:
# go over title_akas
pd.read_sql_query("SELECT * FROM title_akas LIMIT 5;", conn)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Carmencita,\N,\N,original,\N,1
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita,US,\N,imdbDisplay,\N,0
3,tt0000001,4,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
4,tt0000001,5,Καρμενσίτα,GR,\N,imdbDisplay,\N,0

In [20]:
# go over title_crew
pd.read_sql_query("SELECT * FROM title_crew LIMIT 5;", conn)

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000003  nm0721526      \N
3  tt0000004  nm0721526      \N
4  tt0000005  nm0005690      \N

In [21]:
# go over title_episode
pd.read_sql_query("SELECT * FROM title_episode LIMIT 5;", conn)

      tconst parentTconst seasonNumber episodeNumber
0  tt0031458   tt32857063           \N            \N
1  tt0041951    tt0041038            1             9
2  tt0042816    tt0989125            1            17
3  tt0042889    tt0989125           \N            \N
4  tt0043426    tt0040051            3            42

DatabaseError: Execution failed on sql 'SELECT * FROM title_name LIMIT 5;': no such table: title_name